src/Documents/ПакетЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПакетЭД</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресРесурсаКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРесурсаОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаПакета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаПакетаЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийУИД</Name>
					<Comment>Уникальный идентификатор объекта во внешней системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеЗашифрованы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильНастроекЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиНастроекЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПакета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПакетовЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлектронныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияОбИспользованииЭД</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьДанныеЗашифрованы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСертификатШифрования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлектронныйДокумент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СтатусыПакетовЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПакетовЭД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КРаспаковке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовленКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распакован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспакованДокументыНеОбработаны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неизвестный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПакетЭД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обработчик обновления БЭД 1.1.25.0
// Удаляет распакованные пакеты ЭД и переводит на новую архитектуру нераспакованные.
//
// Параметры:
//  Параметры - Структура - параметры обработчика обновления.
//
Процедура ПеревестиНаНовуюАрхитектуруПакетыЭД() Экспорт
	
	УдаляемыеСтатусы = Новый Массив;
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Отправлен);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Распакован);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Отменен);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Неизвестный);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УдаляемыеСтатусы", УдаляемыеСтатусы);
	
	// Удаление пакетов.
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ПакетЭД.Ссылка КАК ПакетСсылка,
	|	ЕСТЬNULL(ЭДПрисоединенныеФайлы.Ссылка, ЗНАЧЕНИЕ(Справочник.ЭДПрисоединенныеФайлы.ПустаяСсылка)) КАК ПрисоединенныйФайлСсылка
	|ИЗ
	|	Документ.ПакетЭД КАК ПакетЭД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|		ПО ПакетЭД.Ссылка = ЭДПрисоединенныеФайлы.УдалитьВладелецФайла
	|ГДЕ
	|	ПакетЭД.СтатусПакета В(&УдаляемыеСтатусы)
	|	И НЕ ПакетЭД.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Пока Не Результат.Пустой() Цикл
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НачатьТранзакцию();
			
			Попытка
				
				ПакетОбъект = Выборка.ПакетСсылка.ПолучитьОбъект();
				ПакетОбъект.ПометкаУдаления = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПакетОбъект);
				
				Если ЗначениеЗаполнено(Выборка.ПрисоединенныйФайлСсылка) Тогда
					ПрисоединенныйФайлОбъект = Выборка.ПрисоединенныйФайлСсылка.ПолучитьОбъект();
					ПрисоединенныйФайлОбъект.ПометкаУдаления = Истина;
					// В связи с тем, что поле "ВладелецФайла" в версии 1.1.25 было заменено (в новом нет типа "Документ.ПакетЭД"),
					// необходимо записать в него пустую ссылку, чтобы обойти ошибку при удалении элемента справочника из базы.
					ПрисоединенныйФайлОбъект.ВладелецФайла = Справочники.СоглашенияОбИспользованииЭД.ПустаяСсылка();
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПрисоединенныйФайлОбъект);
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				Операция = НСтр("ru = 'Обновление подсистемы обмена с контрагентами'");
				ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки);
				ВызватьИсключение;
				
			КонецПопытки;
			
		КонецЦикла;
		
		Результат = Запрос.Выполнить();
		
	КонецЦикла;
	
	// Перевод на новую архитектуру.
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ПакетЭД.Ссылка КАК ПакетСсылка,
	|	ЭДПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайлСсылка
	|ИЗ
	|	Документ.ПакетЭД КАК ПакетЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|		ПО ПакетЭД.Ссылка = ЭДПрисоединенныеФайлы.УдалитьВладелецФайла
	|			И (НЕ ЭДПрисоединенныеФайлы.ПометкаУдаления)
	|ГДЕ
	|	НЕ ПакетЭД.СтатусПакета В (&УдаляемыеСтатусы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПакетЭД.Дата УБЫВ";
	
	Результат = Запрос.Выполнить();
	Пока Не Результат.Пустой() Цикл
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("Справочник.ЭДПрисоединенныеФайлы");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.ПрисоединенныйФайлСсылка);
				Блокировка.Заблокировать();
				
				ДанныеФайла = ПрисоединенныеФайлы.ПолучитьДанныеФайла(Выборка.ПрисоединенныйФайлСсылка,, Истина);
				ПрисоединенныеФайлы.ДобавитьФайл(
					Выборка.ПакетСсылка, ДанныеФайла.ИмяФайла, ДанныеФайла.Расширение,,, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
				
				ФайлОбъект = Выборка.ПрисоединенныйФайлСсылка.ПолучитьОбъект();
				ФайлОбъект.ПометкаУдаления = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФайлОбъект);
				
				ПакетОбъект = Выборка.ПакетСсылка.ПолучитьОбъект();
				Для Каждого СтрокаВладельца Из ПакетОбъект.ЭлектронныеДокументы Цикл
					СтрокаВладельца.ОбъектВладелец = ОбщегоНазначения.ПолучитьЗначениеРеквизита(
						СтрокаВладельца.ЭлектронныйДокумент, "ВладелецФайла");
				КонецЦикла;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПакетОбъект);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				Операция = НСтр("ru = 'Обновление подсистемы обмена с контрагентами'");
				ПодробныйТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЭлектронныеДокументыСлужебныйВызовСервера.ОбработатьОшибку(Операция, ПодробныйТекстОшибки);
				ВызватьИсключение;
				
			КонецПопытки;
			
		КонецЦикла;
		
		Результат = Запрос.Выполнить();
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления БЭД 1.1.25.17
//
// Параметры:
//  Параметры - Структура - параметры обработчика обновления.
//
Процедура ПометитьНаУдалениеПрисоединенныеФайлыПакетовЭД() Экспорт
	
	// Помечаем на удаление присоединенные файлы, которые не пометили при переходе на новую архитектуру.
	
	УдаляемыеСтатусы = Новый Массив;
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Отправлен);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Распакован);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Отменен);
	УдаляемыеСтатусы.Добавить(Перечисления.СтатусыПакетовЭД.Неизвестный);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УдаляемыеСтатусы", УдаляемыеСтатусы);
	
	// Удаление пакетов.
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ЭДПрисоединенныеФайлы.Ссылка
	|ИЗ
	|	Документ.ПакетЭД КАК ПакетЭД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|		ПО ПакетЭД.Ссылка = ЭДПрисоединенныеФайлы.УдалитьВладелецФайла
	|ГДЕ
	|	ПакетЭД.СтатусПакета В(&УдаляемыеСтатусы)
	|	И ПакетЭД.ПометкаУдаления
	|	И НЕ ЭДПрисоединенныеФайлы.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Пока Не Результат.Пустой() Цикл
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ПрисоединенныйФайлОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПрисоединенныйФайлОбъект.ПометкаУдаления = Истина;
			// В связи с тем, что поле "ВладелецФайла" в версии 1.1.25 было заменено (в новом нет типа "Документ.ПакетЭД"),
			// необходимо записать в него пустую ссылку, чтобы обойти ошибку при удалении элемента справочника из базы.
			ПрисоединенныйФайлОбъект.ВладелецФайла = Справочники.СоглашенияОбИспользованииЭД.ПустаяСсылка();
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПрисоединенныйФайлОбъект);
			
		КонецЦикла;
		
		Результат = Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
